<?php
return $str = '注册使用协议<br />

一、总则
1．会员注册使用协议以及单项技术服务条款和公告可由随时更新，且无需另行通知。需求者/服务者在使用相关服务时,应关注并遵守其所适用的相关条款。
	需求者/服务者在使用提供的各项服务之前，应仔细阅读相关的服务协议。如需求者/服务者不同意相关服务协议及/或随时对其的修改，可以申请退出提供的相关服务；需求者/服务者一旦使用或继续使用服务，即视为已了解并完全同意相关服务协议各项内容，包括对各项服务协议随时所做的任何修改。

二、注册信息和隐私保护
2．1　需求者/服务者会员帐号（即会员ID）的所有权归，需求者/服务者完成注册申请手续后，获得帐号的使用权。需求者/服务者应提供及时、详尽及准确的个人资料，并不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。如果因注册信息不真实而引起的问题，并对问题发生所带来的后果，不负任何责任。
2．2　需求者/服务者不应将其帐号、密码转让或出借予他人使用。如需求者/服务者发现其帐号遭他人非法使用，应立即通知。因黑客行为或需求者/服务者的保管疏忽导致帐号、密码遭他人非法使用，不承担任何责任。
2．3　不对外公开或向第三方提供单个需求者/服务者的注册资料，除非：
（1）事先获得需求者/服务者的明确授权；
（2）只有透露或部分透漏需求者/服务者的个人资料，才能提供所要求的产品和服务；
（3）根据有关的法律法规要求；
（4）按照相关政府主管部门的要求；
（5）为维护的合法权益。
2．4  在需求者/服务者注册会员帐户，使用的产品或服务，或参加促销和有奖游戏时，会获得需求者/服务者的个人身份识别资料，并会将这些资料用于：改进为需求者/服务者提供的产品及服务。
2.5  承诺，在收集、使用、共享和存储需求者/服务者所有数据（包括但不限于任何用户信息）时，同意实施并遵守的隐私保护策略
2.6  需求者/服务者明晰，未经用户事先许可，禁止将其访问或收集的与用户相关的任何数据提供给任何第三方
2.7  在公司提出要求时，需求者/服务者应立即向提供配合，以便: 
   (i)保护或维护或者其员工、代理和承包商的合法权利或财产（包括履行协议）；
   (ii)保护服务用户或公众的安全（包括在紧急情况下采取相应措施）；
   (iii)防止欺诈行为或实现风险管理目的；
   (iv)遵守法律、法规或法定程序要求

三、使用规则
3．1　需求者/服务者在使用会员服务时，必须遵守中华人民共和国相关法律法规的规定，需求者/服务者应同意将不会利用会员服务进行任何违法或不正当的活动，包括但不限于下列行为∶
（1）上载、展示、张贴、传播或以其它方式传送含有下列内容之一的信息：
1） 反对宪法所确定的基本原则的； 2） 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； 3） 损害国家荣誉和利益的； 4） 煽动民族仇恨、民族歧视、破坏民族团结的； 5） 破坏国家宗教政策，宣扬邪教和封建迷信的； 6） 散布谣言，扰乱社会秩序，破坏社会稳定的； 7） 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； 8） 侮辱或者诽谤他人，侵害他人合法权利的； 9） 含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容； 10） 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的； 
（2）不得为任何非法目的而使用网络服务系统；
（3）不利用服务从事以下活动：
1) 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；
2) 未经允许，对计算机信息网络功能进行删除、修改或者增加的；
3) 未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；
4) 故意制作、传播计算机病毒等破坏性程序的；
5) 其他危害计算机信息网络安全的行为。
3．2　需求者/服务者违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，需求者/服务者同意自行与第三方沟通协商解决，并赔偿与合作公司、关联公司的直接损失、间接损失等，并使之免受损害。对此，有权视需求者/服务者的行为性质，采取包括但不限于删除需求者/服务者发布信息内容、暂停使用许可、终止服务、限制使用、回收会员帐号、追究法律责任等措施。对恶意注册会员帐号或利用会员帐号进行违法活动、捣乱、骚扰、欺骗其他需求者/服务者以及其他违反本协议的行为，有权回收其会员帐号。同时，会视司法部门的要求，协助调查。
3．3　需求者/服务者不得对会员服务的任何部分或对会员服务的任何使用或获得，进行复制、拷贝、出售、转售或用于任何其它商业目的。
3．4　需求者/服务者须对自己在使用会员服务过程中的行为承担法律责任。需求者/服务者承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在首先承担了因需求者/服务者行为导致的行政处罚或侵权损害赔偿责任后，需求者/服务者应给予等额的赔偿。 

四、服务内容
4．1　会员服务的具体内容由根据实际情况提供。
4．2　除非相关服务协议另有其它明示规定，所推出的新产品、新功能、新服务，均受到本协议之规范。
4．3　为使用会员服务，需求者/服务者必须拥有相应手机产品，并应自行支付相关网络流量使用费。
4．4　鉴于网络服务的特殊性，需求者/服务者同意有权不经事先通知，随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
4．5　需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成网络服务（包括收费网络服务）在合理时间内的中断，无需为此承担任何责任。保留不经事先通知为维修保养、升级或其它目的暂停会员服务任何部分的权利。
4．6　需求者/服务者明确同意其使用会员服务所存在的风险将完全由其自己承担。需求者/服务者理解并接受下载或通过会员服务取得的任何信息资料取决于需求者/服务者自己，并由其承担系统受损、资料丢失以及其它任何风险。
4．7　6个月未登陆的会员帐号，保留关闭的权利。 
4．8　有权于任何时间暂时或永久修改或终止会员服务（或其任何部分），而无论其通知与否，对会员和任何第三人均无需承担任何责任。
4．9　终止服务
需求者/服务者同意得基于其自行之考虑，因任何理由，包含但不限于长时间未使用，或认为需求者/服务者已经违反本协议的文字及精神，终止会员的密码、帐号或会员服务之使用（或服务之任何部分），并将需求者/服务者在会员服务内任何内容加以移除并删除。需求者/服务者同意依本协议及相关规定提供的会员相关服务，无需进行事先通知即可中断或终止，需求者/服务者承认并同意，可立即关闭或删除其帐号及其帐号中所有相关信息及文件，及/或禁止继续使用前述文件或相关的会员服务。此外，需求者/服务者同意若会员相关服务使用被中断或终止或会员帐号及相关信息和文件被关闭或删除，对需求者/服务者或任何第三人均不承担任何责任。

五、知识产权和其他合法权益
5．1　需求者/服务者权利
尊重他人知识产权和合法权益，呼吁需求者/服务者也要同样尊重知识产权和他人合法权益。若需求者/服务者认为其知识产权或其他合法权益被侵犯，请按照以下说明向提供资料∶
　 请注意：如果权利通知的陈述失实，权利通知提交者将承担对由此造成的全部法律责任（包括但不限于赔偿各种费用及律师费）。如果上述个人或单位不确定网络上可获取的资料是否侵犯了其知识产权和其他合法权益，建议该个人或单位首先咨询专业人士。 
　 为了有效处理上述个人或单位的权利通知，请使用以下格式（包括各条款的序号）： 
　　 1. 权利人对涉嫌侵权内容拥有知识产权或其他合法权益和/或依法可以行使知识产权或其他合法权益的权属证明；
　　 2. 请充分、明确地描述被侵犯了知识产权或其他合法权益的情况。
　　 3. 请指明涉嫌侵权网页的哪些内容侵犯了第2项中列明的权利。
　　 4. 请提供权利人具体的联络信息，包括姓名、身份证或护照复印件（对自然人）、或企业法人营业执照副本复印件等单位主体资质证明、登记证明复印件（对单位）、通信地址、电话号码、传真和电子邮件。
　　 5. 请提供涉嫌侵权内容在网络中的具体位置（指明您举报的含有侵权内容的出处，即：指网页地址或网页内的位置）以便我们与您举报的含有侵权内容的网页的所有权人/管理人联系。
　　 6. 请在权利通知中加入如下关于通知内容真实性的声明： “本人/我司保证，本通知中所述信息是充分、真实、准确的，如果本权利通知内容不完全属实，本人/我司将承担由此产生的一切法律责任。”
　　 7. 在上述文件中签字，如果您是依法成立的机构或组织，请您加盖公章。 
　 请您把以上资料和联络方式书面通过邮箱ipr@hushan.so发给我们。　
5．2　拥有本网站内所有资料的版权。任何被授权的浏览、复制、打印和传播属于本网站内的资料必须符合以下条件：
所有的资料和图象均以获得信息为目的；
所有的资料和图象均不得用于商业目的；
所有的资料、图象及其任何部分都必须包括如下版权声明：
①本网站（hushan.so）所有的产品、技术、所有程序均属于知识产权，在此并未授权。
②“ioncall”, “”及相关图形等为的注册商标，未经许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用。否则，将依法追究法律责任。

六、其他
6．1　本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。
6．2　如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向所在地的人民法院提起诉讼。
6．3　未行使或执行本协议任何权利或规定，不构成对前述权利或权利之放弃。
6．4　如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。';
?>